<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>footer</title>
	<link rel="stylesheet" href="css/style.css">
</head>
<body>
 <div class="footer">
            <div class="container">
               <div class="row">
                  <div class="col-md-10 offset-md-1">
                     <div class="cont">
                        <!-- <h3>Contact now</h3> -->
                        <span><button type="button" class="btn btn-primary" data-toggle="modal" data-target="#useragreement">사용자 계약</button><span>&nbsp;&nbsp;|&nbsp;&nbsp;</span><button type="button" class="btn btn-primary" data-toggle="modal" data-target="#privacypolicy">개인 정보 정책</button></span>
                        
                     </div>
                  </div>
               </div>
            </div>
         </div>
    <!-- Modal -->
		<div class="modal fade" id="useragreement" tabindex="-1" role="dialog" aria-labelledby="exampleModalLongTitle" aria-hidden="true">
		  <div class="modal-dialog" role="document">
		    <div class="modal-content">
		      <div class="modal-header">
		        <h3 class="modal-title" id="exampleModalLongTitle">사용자 계약</h3>
		        <button type="button" class="close" data-dismiss="modal" aria-label="Close">
		          <span aria-hidden="true">&times;</span>
		        </button>
		      </div>
		      <div class="modal-body">
		        <h4>1. 소개</h4>
				<h5>1.1 계약</h5>
<p>귀하는 당사 서비스(아래 설명 참조)에 로그인하거나 이와 유사한 방식으로 등록, 액세스 또는 사용함으로써 ChartGame.com과 법적 구속력이 있는 계약을 체결하는 데 동의하는 것입니다(귀하가 회사를 대신하여 당사 서비스를 사용하는 경우에도). 이 계약("계약" 또는 "사용자 계약")에 동의하지 않는 경우 등록하거나 로그인하지 말고 당사 서비스에 액세스하거나 달리 사용하지 마십시오.</p>

<p>귀하의 당사 서비스 사용에는 당사의 개인정보 보호정책도 적용됩니다.</p>

<p>서비스</p>

<p>본 계약은 ChartGame.com 및 기타 ChartGame.com 관련 사이트, 앱, 커뮤니케이션 및 해당 서비스에 대한 오프사이트 데이터 수집을 포함하여 본 계약에 따라 제공된다고 명시한 기타 서비스("서비스")에 적용됩니다. 당사 서비스의 등록된 사용자는 "회원"이고 등록되지 않은 사용자는 "방문자"입니다. 이 계약은 두 가지 모두에 적용됩니다.

ChartGame.com

귀하는 ChartGame.com("당사" 및 "당사"라고도 함)과 본 계약을 체결합니다. 귀하는 ChartGame.com과 본 계약을 체결하고 당사 서비스에 제공되거나 당사 서비스에 의해 수집된 귀하의 개인 데이터는 ChartGame.com이 관리합니다.</p>

<h5>1.2 회원 및 방문자</h5>
<p>ChartGame.com에 등록하고 가입하면 회원이 됩니다. 당사 서비스에 등록하지 않기로 선택한 경우 방문자로서 특정 기능에 액세스할 수 있습니다.</p>

<h5>1.3 변경</h5>
<p>당사는 이 계약과 개인정보 보호정책을 수시로 수정할 수 있습니다. 중대한 변경 사항이 있는 경우 당사 서비스 또는 기타 수단을 통해 귀하에게 통지하여 변경 사항이 효력을 발휘하기 전에 검토할 수 있는 기회를 제공합니다. 변경 사항에 반대하는 경우 계정을 폐쇄할 수 있습니다. 본 약관의 변경 사항에 대한 통지를 게시하거나 발송한 후에도 귀하가 당사 서비스를 계속 사용하는 것은 귀하가 업데이트된 약관에 동의한다는 의미입니다.</p>

<h4>2. 의무</h4>
<h5>2.1 서비스 자격</h5>
<p>서비스를 사용하기 위해 귀하는 다음 사항에 동의합니다. (2) 귀하는 이미 ChartGame.com이 서비스를 사용하는 것을 제한하지 않습니다.</p>

<h5>2.2 귀하의 계정</h5>
<p>회원은 계정 소유자입니다. 귀하는 다음 사항에 동의합니다. (1) 강력하고 안전한 암호를 선택합니다. (2) 비밀번호를 안전하고 기밀로 유지합니다. (3) 법과 해야 할 일과 하지 말아야 할 일 목록을 따릅니다. 계정을 폐쇄하거나 오용을 신고하지 않는 한 계정을 통해 발생하는 모든 일에 대한 책임은 귀하에게 있습니다.

귀하와 타인 사이에서 귀하의 계정은 귀하의 것입니다. 그러나 귀하가 사용하기 위해 다른 당사자가 서비스를 구매한 경우 해당 서비스에 대한 비용을 지불하는 당사자는 해당 유료 서비스에 대한 액세스를 제어하고 귀하의 사용에 대한 보고서를 받을 권리가 있습니다. 그러나 그들은 귀하의 개인 계정에 대한 권리가 없습니다.</p>

<h5>2.3 지불</h5>
<p>당사의 유료 서비스("프리미엄 서비스")를 구매하는 경우 해당 수수료 및 세금을 지불하고 유료 서비스와 관련된 추가 조건에 동의하는 것입니다. 이러한 수수료를 지불하지 않으면 유료 서비스가 종료됩니다. 또한 귀하는 다음 사항에 동의합니다.

- 귀하의 구매는 환율 또는 위치에 따른 가격 차이(예: 환율)가 적용될 수 있습니다.

- 당사는 귀하의 서비스 중단을 방지하고 귀하가 구매할 수 있는 다른 서비스를 지불하는 데 사용하기 위해 만료된 후에도 귀하의 지불 방법(예: 신용 카드)을 저장하고 계속 청구할 수 있습니다.

- 구독을 구매하는 경우 각 구독 기간이 시작될 때 해당 기간에 적용되는 수수료 및 세금이 결제 수단으로 자동 청구됩니다. 향후 청구를 방지하려면 갱신 날짜 전에 취소하십시오.

- 당사는 귀하가 구매 시 제공한 청구 정보를 기반으로 귀하가 지불해야 하는 세금을 계산할 수 있습니다.</p>

<h5>2.4 공지 및 서비스 메시지</h5>
<p>귀하는 당사가 (1) 서비스 내 통지 또는 (2) 귀하가 당사에 제공한 연락처 정보(예: 이메일, 휴대폰 번호, 실제 주소)로 메시지를 보내는 방식으로 귀하에게 통지를 제공하는 데 동의합니다. 귀하는 귀하의 연락처 정보를 최신 상태로 유지하는 데 동의합니다.</p>

<h5>2.5 공유</h5>
<p>당사의 서비스는 정보의 메시징 및 공유를 허용합니다. 귀하가 공유하거나 게시하는 정보 및 콘텐츠는 다른 회원 또는 방문자가 볼 수 있습니다.

당사는 당사 서비스에 정보 또는 콘텐츠를 게시할 의무가 없으며 사전 통지 여부에 관계없이 당사의 단독 재량에 따라 이를 제거할 수 있습니다.</p>

<h4>3. 권리 및 제한</h4>
<h5>3.1. ChartGame.com에 대한 귀하의 라이선스</h5>
<p>귀하와 ChartGame.com 사이에서 귀하는 귀하가 서비스에 제출하거나 게시한 콘텐츠와 정보를 소유하며 ChartGame.com 및 당사 계열사에만 다음 비독점적 라이선스를 부여합니다. 귀하 또는 타인에 대한 추가 동의, 통지 및/또는 보상 없이 귀하가 당사 서비스를 통해 제공하는 정보 및 콘텐츠를 복사, 수정, 배포, 게시 및 처리하는 행위. 이러한 권리는 다음과 같은 방식으로 제한됩니다.

당사는 귀하의 별도 동의 없이 제3자의 제품 및 서비스 광고에 귀하의 콘텐츠를 포함하지 않습니다(스폰서 콘텐츠 포함). 그러나 우리는 귀하 또는 다른 사람에 대한 지불 없이 권리가 있습니다.</p>
		      </div>
		      <div class="modal-footer">
		        <button type="button" class="btn btn-secondary" data-dismiss="modal">Close</button>
		      </div>
		    </div>
		  </div>
		  </div>
	 <!-- Modal -->
		<div class="modal fade" id="privacypolicy" tabindex="-1" role="dialog" aria-labelledby="exampleModalLongTitle" aria-hidden="true">
		  <div class="modal-dialog" role="document">
		    <div class="modal-content">
		      <div class="modal-header">
		        <h3 class="modal-title" id="exampleModalLongTitle">개인 정보 정책</h3>
		        <button type="button" class="close" data-dismiss="modal" aria-label="Close">
		          <span aria-hidden="true">&times;</span>
		        </button>
		      </div>
		      <div class="modal-body">
<h4>소개</h4>
<p>등록된 사용자("회원")는 신원을 공유하고, 네트워크에 참여하고, 지식과 통찰력을 교환하고, 관련 콘텐츠를 게시 및 보고, 과거 주식 시장 데이터로 주식 거래를 배우고 연습합니다. 당사 서비스 중 일부의 콘텐츠는 비회원("방문자")도 사용할 수 있습니다.</p>

<p>데이터 컨트롤러</p>

<p>귀하는 ChartGame.com과 사용자 계약을 체결하며, ChartGame.com은 당사 서비스에 제공되거나 당사 서비스에 의해 또는 당사 서비스를 위해 수집된 귀하의 개인 데이터에 대해 책임을 집니다.</p>

<p>서비스</p>

<p>이 개인 정보 보호 정책은 ChartGame.com 및 기타 ChartGame.com 관련 사이트, 앱, 커뮤니케이션 및 서비스("서비스")에 적용되며, 여기에는 당사 광고 서비스와 같은 오프사이트 서비스가 포함되지만 아래에 제공된다고 명시한 서비스는 제외됩니다. 다른 개인 정보 보호 정책.</p>

<p>동의</p>

<p>귀하가 당사 서비스를 사용하는 경우, 귀하는 본 개인정보 보호정책에 따른 귀하의 개인 데이터 수집, 사용 및 공유에 동의하고 사용자 계약에 동의하는 것입니다.</p>

<p>변화</p>

<p>당사는 본 개인정보 보호정책을 수정할 수 있으며, 중대한 변경이 있는 경우 당사 서비스 또는 기타 수단을 통해 통지하여 변경사항이 효력을 발생하기 전에 귀하에게 변경사항을 검토할 수 있는 기회를 제공할 것입니다. 변경 사항에 반대하는 경우 계정을 폐쇄할 수 있습니다. 이 개인 정보 보호 정책에 대한 변경 사항에 대한 통지를 게시하거나 보낸 후에도 귀하가 계속해서 서비스를 사용하는 것은 업데이트된 개인 정보 보호 정책에 동의한다는 의미입니다.</p>

<h4>1. 수집하는 정보</h4>
<h5>1.1 귀하가 당사에 제공한 정보</h5>
<p>등록</p>

<p>계정을 만들려면 이름, 위치 및 이메일 주소를 포함한 데이터를 제공해야 합니다. 프리미엄 서비스에 등록하면 결제(예: 신용카드) 및 청구 정보를 요청합니다.</p>

<p>프로필</p>

<p>공개를 원하지 않는 개인 데이터를 프로필에 게시하거나 추가하지 마십시오.</p>

<p>게시 및 업로드</p>

<p>귀하가 양식을 작성하거나 설문조사에 응답하거나 친구 요청을 보낼 때와 같이 귀하가 당사 서비스에 이를 제공, 게시 또는 업로드할 때 당사는 귀하로부터 개인 데이터를 수집합니다. 주소록 가져오기를 선택하면 연락처(서비스 제공업체 또는 목록에 없는 주소나 번호로 연락할 때 주소록에 자동으로 추가된 앱의 연락처 정보 포함)가 수신됩니다.</p>

<h5>1.2 타인의 정보</h5>
<p>콘텐츠 및 뉴스</p>

<p>귀하와 다른 사람들은 귀하에 대한 정보가 포함된 콘텐츠를 당사 서비스에 게시할 수 있습니다(블로그 게시물, 피드 업데이트 및 댓글, 비디오의 일부로). 귀하가 선택 해제하지 않는 한, 당사는 귀하에 대한 공개 정보를 수집합니다.</p>

<p>연락처 및 일정 정보</p>

<p>다른 사람이 주소록이나 캘린더를 당사 서비스와 가져오거나 동기화하거나 당사 서비스를 사용하여 메시지를 보낼 때 귀하에 대한 개인 데이터를 수신합니다.</p>

<p>파트너</p>

<p>당사는 귀하가 당사 고객 및 파트너의 서비스를 사용할 때 귀하에 대한 개인 데이터를 수신합니다.</p>

<h5>1.3 서비스 이용</h5>
<p>당사는 귀하가 콘텐츠를 보거나 클릭할 때, 검색을 수행할 때, 당사 모바일 중 하나를 설치할 때와 같이 당사 사이트, 앱 및 플랫폼 기술(예: 당사 오프사이트 플러그인)을 포함하여 당사 서비스를 방문하거나 기타 방식으로 사용할 때 사용 데이터를 기록합니다. 앱을 사용하거나 기사를 공유할 수 있습니다. 당사는 로그인, 쿠키, 장치 정보 및 인터넷 프로토콜("IP") 주소를 사용하여 귀하를 식별하고 사용을 기록합니다.</p>

<h5>1.4 쿠키, 웹 비콘 및 기타 유사 기술</h5>
<p>당사는 쿠키 및 이와 유사한 기술(예: 웹 비콘, 픽셀, 광고 태그 및 장치 식별자)을 사용하여 다양한 서비스 및 장치의 온, 오프 및 장치 전반에 걸쳐 귀하 및/또는 귀하의 장치를 인식합니다.</p>

<h5>1.5 귀하의 장치 및 위치</h5>
<p>귀하가 당사 서비스(다른 사이트의 플러그인 또는 쿠키 또는 유사 기술 포함)를 방문하거나 떠날 때 당사는 귀하가 온 사이트와 다음에 이동하는 사이트의 URL을 모두 수신합니다. 당사는 또한 귀하의 IP 주소, 프록시 서버, 운영 체제, 웹 브라우저 및 추가 기능, 장치 식별자 및 기능, 그리고/또는 ISP 또는 귀하의 이동통신사에 대한 정보를 얻습니다. 귀하가 모바일 장치에서 당사 서비스를 사용하는 경우 해당 장치는 귀하의 위치에 대한 데이터를 당사에 전송합니다. 대부분의 장치에서는 위치 데이터가 당사로 전송되는 것을 방지할 수 있으며 당사는 귀하의 설정을 존중합니다.</p>

<h5>1.6 메시지</h5>
<p>당사는 귀하가 당사 서비스와 관련하여 메시지를 보내거나 받거나 참여할 때 귀하에 대한 정보를 수집합니다. 예를 들어, ChartGame.com 친구 요청을 받으면 귀하가 이에 대해 조치를 취했는지 추적하고 알림을 보내드립니다. 우리는 또한 메시지에 자동 스캔 기술을 사용합니다.</p>

<h5>1.7 타인의 사이트 및 서비스</h5>
<p>귀하가 ChartGame.com에 로그인하거나 플러그인, 광고, 쿠키 또는 유사한 기술을 포함하는 다른 사람의 서비스를 방문할 때 귀하의 방문 및 다른 사람이 제공하는 서비스와의 상호 작용에 대한 정보를 받습니다.</p>

<h5>1.8 기타</h5>
<p>당사 서비스는 동적이며 종종 새로운 기능을 도입하며, 이를 위해서는 새로운 정보 수집이 필요할 수 있습니다. 당사가 실질적으로 다른 개인 데이터를 수집하거나 당사가 귀하의 데이터를 사용하는 방식을 크게 변경하는 경우 당사는 귀하에게 통지하고 본 개인정보 보호정책을 수정할 수도 있습니다.</p>
		      </div>
		      <div class="modal-footer">
		        <button type="button" class="btn btn-secondary" data-dismiss="modal">Close</button>
		      </div>
		    </div>
		  </div>
</div>
</body>
</html>